Revit 2027 API
DockablePaneProviderData.GetFrameworkElement Method
 Wrapper function that returns the FrameworkElement for this provider.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FrameworkElement GetFrameworkElement()
Public Function GetFrameworkElement As FrameworkElement
public:
FrameworkElement^ GetFrameworkElement()
member GetFrameworkElement : unit -> FrameworkElement
Return Value
FrameworkElement
 FrameworkElement to use as the pane's user interface.
Remarks
 If an IFrameworkElementCreator is provided, that will be called to generate the element, otherwise, the FrameworkElement associated with the provider is returned.
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace